app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function process_login()
        {
            $model = new \App\Models\UserModel();
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $roleInput = strtolower(trim($this->request->getPost('role')));

            $user = $model->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `username` = 'Danish'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `role`, `created_at`) VALUES ('Danish', '$2y$10$Pb2b6tnKt2N8UOypAtjz/e4x1Dr/RJafQwyk6J8W/bzkYIRShKK.u', 'staff_gudang', '2026-01-06 23:03:09')
---
    public function process_register()
    {
        $userModel = new UserModel();
        $employeeModel = new \App\Models\EmployeeModel(); // Panggil model karyawan

        // Ambil input
        $nama     = $this->request->getPost('nama_lengkap');
        $hp       = $this->request->getPost('no_hp');
        $username = $this->request->getPost('username');
        $role     = $this->request->getPost('role');
        $pass     = $this->request->getPost('password');
        $passConf = $this->request->getPost('password_confirm');

        // 1. Validasi Password
        if ($pass != $passConf) {
            return redirect()->back()->with('error', 'Password konfirmasi tidak cocok!');
        }

        // 2. Cek Username Kembar
        if ($userModel->where('username', $username)->first()) {
            return redirect()->back()->with('error', 'Username sudah dipakai!');
        }

        // 3. Mulai Transaksi Database (Biar aman)
        $db = \Config\Database::connect();
        $db->transStart();

        // A. Simpan ke Tabel USERS (Akun Login)
        $userModel->save([
            'username' => $username,
            'password' => password_hash($pass, PASSWORD_DEFAULT),
            'role'     => $role
        ]);

INSERT INTO `employees` (`nama_lengkap`, `posisi`, `no_hp`, `gaji_pokok`, `tunjangan`, `created_at`) VALUES ('Danish keren', 'Staff Gudang', '08123', 0, 0, '2026-01-06 23:03:09')
---
        if($role == 'sales') $posisi = 'Sales';
        if($role == 'staff_gudang') $posisi = 'Staff Gudang';

        $employeeModel->save([
            'nama_lengkap' => $nama,
            'posisi'       => $posisi,
            'no_hp'        => $hp,
            'gaji_pokok'   => 0, // Default 0, nanti diedit admin
            'tunjangan'    => 0
        ]);