app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `employees`
---

        // 4. Hitung Laba & Total Karyawan
        $laba_bersih    = $omzet - $modal - $gaji;
        $total_karyawan = $db->table('employees')->countAllResults();

SELECT *
FROM `products`
WHERE `stok` < 10
ORDER BY `stok` ASC
 LIMIT 5
---
        $chartData = $queryChart->getResultArray();

        // 2. STOK MENIPIS (Limit < 10)
        $stokMenipis = $db->table('products')
                          ->where('stok <', 10)
                          ->orderBy('stok', 'ASC')
                          ->limit(5)
                          ->get()->getResultArray();