app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `products`
---

        // --- E. DATA PENDUKUNG ---
        $total_karyawan = $db->table('employees')->countAllResults();
        $total_produk   = $db->table('products')->countAllResults();