app/Controllers/Gaji.php

SELECT *
FROM `employees`
---
    public function create()
    {
        $employeeModel = new EmployeeModel();
        $data = [
            'title'     => 'Hitung Gaji Karyawan',
            'employees' => $employeeModel->findAll()

SELECT *
FROM `employees`
WHERE `employees`.`id` = '3'
---
    public function process()
    {
        $employeeModel   = new EmployeeModel();
        $payrollModel    = new PayrollModel(); // AttendanceModel tidak perlu diload jika pakai manual query

        $employee_id = $this->request->getPost('employee_id');
        $bulan       = $this->request->getPost('bulan'); // Format: 2026-01

        // 1. Ambil Data Karyawan (Untuk tahu Gaji Pokok & NAMANYA)
        $karyawan = $employeeModel->find($employee_id);

INSERT INTO `payroll` (`employee_id`, `bulan_tahun`, `total_hadir`, `potongan`, `total_gaji_bersih`) VALUES ('3', '2026-01', '0', 0, 1750000)
---
        $gaji_bersih = $gaji_kotor - $total_potongan;

        // 4. Simpan ke Database Payroll
        $payrollModel->save([
            'employee_id'       => $employee_id,
            'bulan_tahun'       => $bulan,
            'total_hadir'       => $total_hadir,
            'potongan'          => $total_potongan,
            'total_gaji_bersih' => $gaji_bersih
        ]);