app/Controllers/Karyawan.php

SELECT *
FROM `employees`
---
    public function index()
    {
        $data = [
            'title'     => 'Data Karyawan',
            'employees' => $this->employeeModel->findAll()

INSERT INTO `employees` (`nama_lengkap`, `posisi`, `gaji_pokok`, `tunjangan`, `no_hp`, `created_at`) VALUES ('wira', 'Staff Gudang', '2500000', '300000', '08123', '2026-01-11 21:24:49')
SELECT *
FROM `users`
WHERE `username` = 'wira'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `role`, `nama_lengkap`, `foto`, `created_at`) VALUES ('wira42', '$2y$10$hlLORQ124H0lj1VlG47hAO8JvgzpvYmOtJGFgYlwv8Q1W32YDc1j6', 'staff_gudang', 'wira', 'default.png', '2026-01-11 21:24:49')
---
    public function store()
    {
        // 1. Simpan Data Karyawan (Kode Lama)
        $nama = $this->request->getPost('nama_lengkap');
        $posisi = $this->request->getPost('posisi');

        $this->employeeModel->save([
            'nama_lengkap' => $nama,
            'posisi'       => $posisi,
            'no_hp'        => $this->request->getPost('no_hp'),
            'gaji_pokok'   => $this->request->getPost('gaji_pokok'),
            'tunjangan'    => $this->request->getPost('tunjangan'),
        ]);

        // 2. [BARU] Buatkan Akun Login Otomatis
        $userModel = new \App\Models\UserModel();

        // Ambil kata pertama nama sebagai username (biar simpel)
        $arrNama = explode(' ', trim($nama));
        $username = strtolower($arrNama[0]);

        // Normalisasi role (posisi di karyawan -> role di users)
        $role = 'karyawan';
        if(stripos($posisi, 'Kasir') !== false) $role = 'kasir';
        if(stripos($posisi, 'Sales') !== false) $role = 'sales';
        if(stripos($posisi, 'Gudang') !== false) $role = 'staff_gudang';

        // Cek dulu user sudah ada belum, kalau belum buatkan
        if (!$userModel->where('username', $username)->first()) {
            $userModel->save([
                'username' => $username,
                'password' => password_hash('password123', PASSWORD_DEFAULT), // Default
                'role'     => $role
            ]);