app/Controllers/Laporan.php

    public function index()
    {
        $saleModel = new SaleModel();
        $saleItemModel = new SaleItemModel();
        $payrollModel = new PayrollModel();

        // 1. Hitung Total Pemasukan (Omzet Penjualan)
        $queryPenjualan = $saleModel->selectSum('grand_total')->get()->getRow();
        $total_penjualan = $queryPenjualan->grand_total ?? 0;

        // 2. Hitung Total Pengeluaran Gaji
        $queryGaji = $payrollModel->selectSum('total_gaji_bersih')->get()->getRow();
---
SELECT SUM(`grand_total`) AS `grand_total`
FROM `sales`
SELECT SUM(`total_gaji_bersih`) AS `total_gaji_bersih`
FROM `payroll`

            'total_gaji'      => $total_gaji,
            'laba_bersih'     => $laba_bersih,
            // Kita kirim juga data transaksi terakhir buat tabel
            'recent_sales'    => $saleModel->orderBy('id', 'DESC')->findAll(5)
---
SELECT *
FROM `sales`
ORDER BY `id` DESC
 LIMIT 5