app/Models/AttendanceModel.php

SELECT `attendance`.*, `employees`.`nama_lengkap`, `employees`.`posisi`
FROM `attendance`
JOIN `employees` ON `employees`.`id` = `attendance`.`employee_id`
ORDER BY `attendance`.`tanggal` DESC
---
    public function getAttendanceWithNames()
    {
        return $this->select('attendance.*, employees.nama_lengkap, employees.posisi')
                    ->join('employees', 'employees.id = attendance.employee_id')
                    ->orderBy('attendance.tanggal', 'DESC')
                    ->findAll();