app/Models/PayrollModel.php

SELECT `payroll`.*, `employees`.`nama_lengkap`, `employees`.`posisi`
FROM `payroll`
JOIN `employees` ON `employees`.`id` = `payroll`.`employee_id`
ORDER BY `payroll`.`id` DESC
---
    public function getPayrollWithNames()
    {
        return $this->select('payroll.*, employees.nama_lengkap, employees.posisi')
                    ->join('employees', 'employees.id = payroll.employee_id')
                    ->orderBy('payroll.id', 'DESC')
                    ->findAll();