app/Models/StockHistoryModel.php

SELECT `stock_histories`.*, `products`.`nama_barang`, `products`.`kode_barang`
FROM `stock_histories`
JOIN `products` ON `products`.`id` = `stock_histories`.`product_id`
ORDER BY `stock_histories`.`id` DESC
---
    public function getHistoryWithProduct()
    {
        return $this->select('stock_histories.*, products.nama_barang, products.kode_barang')
                    ->join('products', 'products.id = stock_histories.product_id')
                    ->orderBy('stock_histories.id', 'DESC')
                    ->findAll();