app/Views/dashboard_view.php


                        <?php
                            $userModel = new \App\Models\UserModel();
                            $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'